app/Controllers/Auth.php

    public function login()
    {
        // Check for a POST request
        if ($this->request->getMethod() === 'POST') {
            // Set validation rules for email and password
            $validation = \Config\Services::validation();
            $validation->setRules([
                'email' => 'required|valid_email',
                'password' => 'required'
            ]);

            if ($validation->withRequest($this->request)->run()) {
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');

                try {
                    // If validation passes, check the database for a user using the provided email
                    $builder = $this->db->table('users');
                    $user = $builder->where('email', $email)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `email` = 'getis985@gmail.com'